"""
3. Реализовать программу работы с органическими клетками. Необходимо создать
класс Клетка. В его конструкторе инициализировать параметр, соответствующий
количеству клеток (целое число). В классе должны быть реализованы методы
перегрузки арифметических операторов: сложение (__add__()), вычитание
(__sub__()), умножение (__mul__()), деление (__truediv__()).
Данные методы должны применяться только к клеткам и выполнять увеличение,
уменьшение, умножение и обычное (не целочисленное) деление клеток,
соответственно. В методе деления должно осуществляться округление значения
до целого числа.

Сложение. Объединение двух клеток. При этом число ячеек общей клетки должно
равняться сумме ячеек исходных двух клеток.
Вычитание. Участвуют две клетки. Операцию необходимо выполнять только если
разность количества ячеек двух клеток больше нуля, иначе выводить
соответствующее сообщение.
Умножение. Создается общая клетка из двух. Число ячеек общей клетки
определяется как произведение количества ячеек этих двух клеток.
Деление. Создается общая клетка из двух. Число ячеек общей клетки определяется
как целочисленное деление количества ячеек этих двух клеток.

В классе необходимо реализовать метод make_order(), принимающий экземпляр класса
и количество ячеек в ряду. Данный метод позволяет организовать ячейки по рядам.
Метод должен возвращать строку вида *****\n*****\n*****..., где количество ячеек
между \n равно переданному аргументу. Если ячеек на формирование ряда не
хватает, то в последний ряд записываются все оставшиеся.
Например, количество ячеек клетки равняется 12, количество ячеек в ряду — 5.
Тогда метод make_order() вернет строку: *****\n*****\n**.
Или, количество ячеек клетки равняется 15, количество ячеек в ряду — 5. Тогда
метод make_order() вернет строку: *****\n*****\n*****.
"""


class Cage:
    def __init__(self, count: int):
        self.cells = abs(count)

    def __add__(self, other):
        return Cage(self.cells + other.cells)

    def __sub__(self, other):
        l, r = self.cells, other.cells
        result = max(l, r) - min(l, r)
        if result != 0:
            return Cage(result)
        print('Число ячеек должно быть разным.')

    def __mul__(self, other):
        return Cage(self.cells * other.cells)

    def __truediv__(self, other):
        result = round(self.cells / other.cells)
        return Cage(result)

    def make_order(self, cells_row: int):
        grid = []
        if self.cells < cells_row:
            return '*' * self.cells
        lines = self.cells // cells_row
        tail = self.cells % cells_row
        grid.extend(['{}\n'.format('*' * cells_row) for _ in range(lines)])
        if tail:
            grid.append('*' * tail)
        return ''.join(grid)


cage1 = Cage(-62)
cage2 = Cage(24)
cage_add = cage1 + cage2
cage_sub = cage2 - cage1
cage_mul = cage1 * cage2
cage_div = cage1 / cage2

print('Сложение:', cage_add.cells)
print('Вычитание:', cage_sub.cells)
print('Умножение:', cage_mul.cells)
print('Простое деление:', cage_div.cells)

print('Рисуем клетку:')
print(cage1.make_order(12))
